app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
---
  def index
    @tasks = Task.all

INSERT INTO "tasks" ("title", "content", "publish", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "今日もレトルトカレー"], ["content", "おいしい"], ["publish", "2017-07-04"], ["created_at", "2017-07-04 12:11:07.040834"], ["updated_at", "2017-07-04 12:11:07.040834"]]
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "ヨーロッパ"], ["content", "一周"], ["updated_at", "2017-07-04 12:30:37.219338"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_task
      @task = Task.find(params[:id])